Revit 2026 API

# DocumentType Enumeration

---

Types of Revit documents.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DocumentType
```
```vb
Public Enumeration DocumentType
```
```cpp
public enum class DocumentType
```
```fsharp
type DocumentType
```

| Member name | Value | Description |
| --- | --- | --- |
| BuildingComponent | 4 | Building Component document. |
| Family | 1 | Family document. |
| IFC | 3 | IFC document. |
| Other | 100 | Document of another type. |
| Project | 0 | Project document. |
| Template | 2 | Template document. |

#### Reference

Autodesk.Revit.DB Namespace